Revit 2027 API
FaceDetailNode.GetLinkTransform Method
 Returns link transform of the object being drawn.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetLinkTransform()
Public Function GetLinkTransform As Transform
public:
Transform^ GetLinkTransform()
member GetLinkTransform : unit -> Transform
Return Value
Transform
See Also
Reference
FaceDetailNode Class
Autodesk.Revit.DB Namespace